app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "thyrtyrt"], ["created_at", "2015-08-18 07:53:47.910712"], ["updated_at", "2015-08-18 07:53:47.910712"]]
---
	def create
		@category = Category.create(category_params)