app/controllers/posts_controller.rb

	def create
    	@post = current_user.posts.create(post_params)
    	@post.update_attributes(topic_id: @topic.id)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "dsfsdcdc"], ["user_id", 1], ["created_at", "2015-08-17 09:07:10.260724"], ["updated_at", "2015-08-17 09:07:10.260724"]]
UPDATE "posts" SET "topic_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["topic_id", 5], ["updated_at", "2015-08-17 09:07:10.387141"], ["id", 1]]

   		def set_topic
    	  @topic = Topic.friendly.find(params[:topic_id])
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 6]]