app/controllers/topics_controller.rb

SELECT  "topics".* FROM "topics" LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "topics"
---
  def index
    @topics = Topic.all.page params[:page]

INSERT INTO "topics" ("title", "user_id", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "bengu"], ["user_id", 1], ["slug", "bengu"], ["created_at", "2015-08-17 11:34:03.689088"], ["updated_at", "2015-08-17 11:34:03.689088"]]
INSERT INTO "category_topics" ("topic_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["topic_id", 11], ["category_id", 3], ["created_at", "2015-08-18 09:14:25.652759"], ["updated_at", "2015-08-18 09:14:25.652759"]]
---
  def create
  	#binding.pry
    @topic = current_user.topics.create(topic_params)

    params[:category_ids].each do |category_id|
      CategoryTopic.create(topic_id: @topic.id, category_id: category_id.to_i)

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_topic
      @topic = Topic.friendly.find(params[:id])

SELECT "categories".* FROM "categories"
---
    def set_categories
      @categories = Category.all