app/controllers/users_controller.rb

UPDATE "users" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["avatar_file_name", "commit2.png"], ["avatar_file_size", 164687], ["avatar_updated_at", "2015-08-17 13:02:09.930545"], ["updated_at", "2015-08-17 13:02:10.191931"], ["id", 1]]
---
  def update_profile
  	@user = current_user.update(user_params)